[{"questionNumber":21,"questionText":"Which of the following is NOT a characteristic of Zaid crops in India?","statements":[],"statementInstructions":"","options":["They are grown between the Rabi and Kharif seasons.","They need heavy rainfall for optimal growth.","They typically include seasonal fruits and vegetables.","They have a shorter growing season compared to Rabi and Kharif crops."],"type":"MCQ"},{"questionNumber":22,"questionText":"What best describes a windfall tax?","statements":[],"statementInstructions":"","options":["A tax imposed only on multinational corporations operating in foreign nations.","A tax levied on unexpected or unusually high profits, often resulting from external factors.","A tax specifically targeting the energy sector to encourage renewable energy sources.","A tax applied to long-term capital gains from investments."],"type":"MCQ"},{"questionNumber":23,"questionText":"Which of the following best distinguishes \"Adjournment Sine Die\" from \"Prorogation\"?","statements":[],"statementInstructions":"","options":["Adjournment sine die is decided by the President, while prorogation is decided by the Speaker.","Adjournment sine die refers to indefinite suspension, while prorogation marks the formal end of a Parliamentary session.","Adjournment sine die dissolves the House, while prorogation merely ends a session.","Adjournment sine die and prorogation are identical in meaning."],"type":"MCQ"},{"questionNumber":24,"questionText":"Which of the following greenhouse gases have the highest atmospheric lifetime in years?","statements":[],"statementInstructions":"","options":["Methane","Nitrous Oxide","Hydrofluorocarbons","Chlorofluorocarbons"],"type":"MCQ"},{"questionNumber":25,"questionText":"Which of the following Articles of the Constitution of India provides for separation of judiciary from executive?","statements":[],"statementInstructions":"","options":["Article 51","Article 50","Article 49","Article 48"],"type":"MCQ"},{"questionNumber":26,"questionText":"The 18th edition of the Pravasi Bharatiya Divas will take place in Bhubaneswar from January 8 to 10, 2025. The event aims to strengthen ties with the Indian diaspora and celebrate their contributions to the nation's development. Which of the following statements is / are correct?","statements":["Pravasi Bharatiya Divas is celebrated annually on January 9. This date marks Mahatma Gandhi's return to India from South Africa in 1915.","This year's theme is \"Diaspora's Contribution to a Viksit Bharat.\""],"statementInstructions":"Select the correct answer using the codes given below:","options":["1 only","2 only","Both 1 & 2","Neither 1 nor 2"],"type":"STATEMENT_TYPE"},{"questionNumber":27,"questionText":"Who was the member of the Parliament from Guwahati Lok Sabha constituency in the first Lok Sabha?","statements":[],"statementInstructions":"","options":["Fakhruddin Ali Ahmed","Hem Barua","Rohini Kumar Chaudhuri","Debakanta Baruah"],"type":"MCQ"},{"questionNumber":28,"questionText":"CRISIL is often seen in the news, it is a:","statements":[],"statementInstructions":"","options":["An international NGO focussed on disaster management","Credit rating agency headquartered in India","A global energy finance company","Group of least developed countries (LDCs) committed to development"],"type":"MCQ"},{"questionNumber":29,"questionText":"Consider the following statements:","statements":["North Eastern Council (NEC) is a statutory advisory body constituted under the North Eastern Council Act 1971 and came into being on 8 August 1972.","The eight States of Northeast India are members of the council, with their respective Chief Ministers and Governors representing them.","The headquarters of the council is situated in Shillong and functions under the Ministry of Development of North Eastern Region (DONER) of the Government of India."],"statementInstructions":"Select the correct answer using the codes given below:","options":["1 & 2 only","1 & 3 only","1 only","1, 2 & 3"],"type":"STATEMENT_TYPE"},{"questionNumber":30,"questionText":"The infrastructure development project with the aim of promoting 'port-led development' in India has been named __________?","statements":[],"statementInstructions":"","options":["Bharatmala","Sagarmata","Sagarnaman","Sagarmala"],"type":"MCQ"}]