[{"questionNumber":11,"questionText":"Which of the following pairs is / are incorrectly matched?","statements":["Swat Valley : Pakistan","Sinai Peninsula : Egypt","Anatolia : Turkey"],"statementInstructions":"Select the answer using the codes given below:","options":["1 only","2 only","3 only","None"],"type":"MCQ"},{"questionNumber":12,"questionText":"Consider the following statements about Mughal Dynasty:","statements":["They belonged to a branch of the Timurid dynasty.","This dynasty was founded in 1526 by Babur, a chieftain from what is today Uzbekistan.","Babur's forces defeated Ibrahim Lodi, Sultan of Delhi, in the First Battle of Panipat."],"statementInstructions":"Select the correct answer using the codes given below:","options":["2 & 3 only","1 & 2 only","3 only","1, 2 & 3"],"type":"MCQ"},{"questionNumber":13,"questionText":"Consider the following statements:","statements":["In 1919, the Rowlatt Act gave extensive powers to the British government and allowed indefinite arrest and detention of individuals, warrantless searches and seizures, restrictions on public gatherings, and intensive censorship of media and publications.","Defence of India Act 1915 was an emergency criminal law enacted by the Governor-General of India in 1915 with the intention of curtailing the nationalist and revolutionary activities during and in the aftermath of the First World War."],"statementInstructions":"Select the correct answer using the codes given below:","options":["1 only","2 only","Both 1 & 2","Neither 1 & 2"],"type":"MCQ"},{"questionNumber":14,"questionText":"The term \"Interim Budget\" is used when _________?","statements":[],"statementInstructions":"","options":["A new government is formed","The government is facing financial constraints","A budget is presented during an election year","The budget is presented for a short period before a new fiscal year"],"type":"MCQ"},{"questionNumber":15,"questionText":"The Foreign exchange reserve of India is managed by _______________?","statements":[],"statementInstructions":"","options":["Reserve Bank of India (RBI)","Government of India","Jointly by RBI and Scheduled commercial banks","Jointly by RBI and IMF"],"type":"MCQ"},{"questionNumber":16,"questionText":"The term 'Protectionism' is often seen in the news. What does it mean?","statements":[],"statementInstructions":"","options":["Imposing trade restrictions to protect domestic industry","Entering into alliances with foreign militaries to safeguard one's borders","Mandating military conscription for better defence capabilities","Protecting one's citizens from influence of foreign cultures"],"type":"MCQ"},{"questionNumber":17,"questionText":"Consider the following statements:","statements":["Dadabhai Naoroji was the first Indian to become a member of British parliament","He was the exponent of the theory of economic drain of India during British rule","He authored the book 'Poverty and Un-british rule in India'"],"statementInstructions":"Select the correct answer using the codes given below:","options":["1 & 2 only","1 & 3 only","2 & 3 only","1, 2 & 3"],"type":"MCQ"},{"questionNumber":18,"questionText":"\"Imperialism and militarism are the twin children of capitalism\". Who made this statement and was also the first person to link capitalism with imperialism?","statements":[],"statementInstructions":"","options":["Lala Lajpat Rai","C.R. Das","S.C. Bose","Dewan Chaman Lal"],"type":"MCQ"},{"questionNumber":19,"questionText":"Jawahar tunnel is located in which pass?","statements":[],"statementInstructions":"","options":["Banihal pass","Changla pass","Zoji la","Baralacha pass"],"type":"MCQ"},{"questionNumber":20,"questionText":"The term 'Crony capitalism' is often seen in the news, refers to?","statements":[],"statementInstructions":"","options":["Displacement of socialism with model of capitalism","Adverse effects of capitalism on sustainability of growth process","Mutually advantageous relationships between business leaders and government officials","Greater importance of the money sector vis-à-vis the real sector"],"type":"MCQ"}]