[{"questionNumber":91,"questionText":"With reference to Mising Sahitya Sabha, also known as Mising Agom Kébang, which of the following statements is / are correct?","statements":["It was established on 18 April 1972 at Disangmukh in the district of Sivasagar, Assam.","It has demanded the use of Mising language as a medium of instruction at the school level which has been accepted by the Government of Assam."],"statementInstructions":"Select the answer using the codes given below:","options":["1 only","2 only","Both 1 & 2","Neither 1 nor 2"],"type":"STATEMENT_TYPE"},{"questionNumber":92,"questionText":"The Union Council of Ministers is the principal executive organ of the Government of India, which serves to aid and advice the President of India in execution of their functions. It is chaired by the Prime Minister of India and consists of the heads of each of the executive government ministries. Currently, who is the Finance Minister of India?","statements":[],"statementInstructions":"","options":["Amit Shah","Rajnath Singh","Nirmala Sitaraman","Nitin Gadkari"],"type":"MCQ"},{"questionNumber":93,"questionText":"Consider the following pairs:","statements":["Religion / Sect - Founder","1) Jainism : Mahavira","2) Buddhism : Gautam Buddha","3) Ajivikas : Makhali Gosala"],"statementInstructions":"Select the incorrectly matched pairs using the codes given below:","options":["1 only","2 & 3 only","1 & 3 only","None"],"type":"STATEMENT_TYPE"},{"questionNumber":94,"questionText":"On 25 April 1945, 50 nations assembled in San Francisco, California, for a conference and initialized the drafting of the UN Charter, which was adopted on 25 June 1945. The charter took effect on 24 October 1945, when the United Nation (UN) began operations. The UN is the successor of which organisation?","statements":[],"statementInstructions":"","options":["League against Imperialism","League of Nation","International Court of Justice","Court of Arbitration"],"type":"MCQ"},{"questionNumber":95,"questionText":"__________________, a prince of the Mao-Shan sub-tribe left Mong Mao in 1215. He was accompanied by three queens, two sons and a daughter; chiefs from five other dependent Mongs; members of the priestly class and soldiers—a total contingent of 9,000. He was the founder of the Ahom kingdom and the architect of Assam. The kingdom he established in 1228 existed for nearly six hundred years and in the process unified the various ethnic groups of the region that left a deep impact on the region?","statements":[],"statementInstructions":"","options":["Chaolung Sukaphaa","Suhungmung","Susenghphaa","Sukhrungphaa"],"type":"MCQ"},{"questionNumber":96,"questionText":"Match the following Historical Event in List – I with their respective Years in List – II:","statements":["A) Industrial Revolution - 1) 1917","B) American Revolution - 2) 1789","C) French Revolution - 3) 1776","D) Russian Revolution - 4) 1750"],"statementInstructions":"Select the correct answer using the codes given below:","options":["A-4, B-3, C-2, D-1","A-3, B-4, C-1, D-2","A-4, B-2, C-3, D-1","A-1, B-2, C-3, D-4"],"type":"MCQ"},{"questionNumber":97,"questionText":"With reference to Treaty of Yandabo consider the following statements:","statements":["The treaty was signed on 24 February 1826 that ended the First Anglo-Burmese War.","It was signed by Gen. Campbell from the British side and Governor of Legaing Maha Min Hla Kyaw Htin from the Burmese side.","Burmese King Bagyidaw signed the treaty with the British with payment of an indemnity equivalent to £1,000,000 and renunciation of all Burmese claims in Assam and Manipur, which became British protectorates."],"statementInstructions":"Select the correct answer using the codes given below:","options":["1 & 3 only","1 & 2 only","1 only","1, 2 & 3"],"type":"STATEMENT_TYPE"},{"questionNumber":98,"questionText":"Consider the following statements:","statements":["Bhupen Hazarika Bridge connects the village of Dhola in the south to the village of Sadiya to the north, both in Tinsukia district of Assam.","Bogibeel Bridge between Dhemaji district and Dibrugarh district, is the longest rail-cum-road bridge in India."],"statementInstructions":"Select the correct answer using the codes given below:","options":["1 only","2 only","Both 1 & 2","Neither 1 nor 2"],"type":"STATEMENT_TYPE"},{"questionNumber":99,"questionText":"Read the following Text (1 & 2) and answer the following question: Text 1: Social media platforms have transformed the way people communicate, offering instant connectivity and a platform for sharing information and ideas. However, concerns have been raised about the negative impact of social media on mental health, particularly among teenagers. Studies have linked excessive social media use to increased feelings of anxiety, depression, and loneliness. Text 2: Psychologist Dr. Srivastava conducted a study to explore the relationship between social media use and mental health. She found that the impact of social media on mental health varies depending on how it is used. For example, active engagement, such as meaningful interactions and content creation, was associated with positive mental health outcomes, while passive consumption, such as scrolling through feeds without interaction, was linked to negative mental health outcomes. Based on the texts, how would Dr. Srivastava (Text 2) most likely respond to the concerns about social media's impact on mental health discussed in Text 1?","statements":[],"statementInstructions":"","options":["By arguing that social media has no impact on mental health","By suggesting that all forms of social media use are harmful to mental health","By acknowledging the concerns but emphasizing that the impact depends on how social media is used","By claiming that social media always leads to positive mental health outcomes"],"type":"MCQ"},{"questionNumber":100,"questionText":"Read the passage and answer the following question: \"I read somewhere that in ancient times the prestige of a kingdom depended upon the number of taxes that it was able to levy on its people. It was very much like the prestige of a head-hunter in his own community.\" Based on the paragraph above, the prestige of a head-hunter depended upon ___________?","statements":[],"statementInstructions":"","options":["the prestige of the kingdom","the prestige of the heads","the number of taxes he could levy","the number of heads he could gather"],"type":"MCQ"}]