[{"questionNumber":41,"questionText":"With reference to Census of India consider the following statements:","statements":["The first official population census of India was conducted in 1872.","Since 1949, it has been conducted by the Registrar General and Census Commissioner of India under the Ministry of Home Affairs.","The slogan of Census 2011 is \"Our Census, Our Future\"."],"statementInstructions":"Select the correct answer using the codes given below:","options":["1 & 3 only","2 & 3 only","3 only","1, 2 & 3"],"type":"STATEMENT_TYPE"},{"questionNumber":42,"questionText":"With reference to first council of minister of independent India which of the following pairs is not true?","statements":["Jawaharlal Nehru : Minister of External Affairs and Commonwealth relations","Sardar Vallabhbhai Patel: Minister of Home Affairs and States","Maulana Abul Kalam Azad : Minister of Education"],"statementInstructions":"Select the answer using the codes given below:","options":["1, 2 & 3","1 only","3 only","None"],"type":"STATEMENT_TYPE"},{"questionNumber":43,"questionText":"Which of the following statements is/are not correct?","statements":["National Planning Committee was set up under the INC president Subhash Chandra Bose in 1938","All India Forward Bloc was founded by Bose in 1939"],"statementInstructions":"Select the answer using the codes given below:","options":["Both 1 & 2","1 only","2 only","Neither 1 nor 2"],"type":"STATEMENT_TYPE"},{"questionNumber":44,"questionText":"With reference to Partition of Bengal which of the following statements is/are true?","statements":["Partition was announced on 20th July 1905 and put into effect on 16th October 1905","Sir Andrew Fraser was the Lieutenant Governor of Bengal at the time of Partition","British used the partition to carry out their divide and rule agenda in India"],"statementInstructions":"Select the answer using the codes given below:","options":["1, 2 & 3","1 & 3 only","2 only","2 & 3 only"],"type":"STATEMENT_TYPE"},{"questionNumber":45,"questionText":"Recently, 'Al Aqsa' mosque was in news. This mosque is located in _____?","statements":[],"statementInstructions":"","options":["Tel Aviv","Jerusalem","Sanaa","Abu Dhabi"],"type":"MCQ"},{"questionNumber":46,"questionText":"Which of these tributaries is not a north bank tributary of Brahmaputra?","statements":[],"statementInstructions":"","options":["Subansiri","Ronganadi","Kulsi","Jiabhorali"],"type":"MCQ"},{"questionNumber":47,"questionText":"Which of these country does not share an international boundary with Russia?","statements":[],"statementInstructions":"","options":["Norway","Sweden","Finland","Poland"],"type":"MCQ"},{"questionNumber":48,"questionText":"With reference to Dima Hasao district which of these following is/are not true?","statements":[],"statementInstructions":"","options":["It is one of the three hill district of Assam and its headquarter is located at Haflong","It shares boundary with neighbouring states of Nagaland, Manipur and Meghalaya","It is the second largest district of Assam after Karbi Anglong","Laike, highest peak of Assam, is located in the district"],"type":"MCQ"},{"questionNumber":49,"questionText":"Which of the following pair is incorrect?","statements":[],"statementInstructions":"","options":["Jonbeel Mela : Tiwa Tribe","Wangala : Khasi Tribe","Porag Festival : Mising Tribe","Behdienkhlam Festival : Jaintia Tribe"],"type":"MCQ"},{"questionNumber":50,"questionText":"Some women of Assam took part in the Civil Disobedience Movement very actively. To mobilize the girls in the National Movement, an organization namely namely the 'Mukti Sangha' was established by a few prominent and leading activists. Their fiery spirited speeches encouraged many young minds to fight for 'Poorna Swaraj'. It was during this movement that at various places of Assam Nari Bahinis or Women Squads were formed for carrying out various programmes of the movement. Examine the above statement and select the one who was not related with the Mukti Sangha.","statements":[],"statementInstructions":"","options":["Pushpalata Das","Sarala Saxena","Punyaprava Barua","None"],"type":"MCQ"}]