[{"questionNumber":1,"questionText":"With reference to Securities and Exchange Board of India (SEBI) consider the following statements:","statements":["It was first established in 1988 as a non-statutory body for regulating the securities market.","It became an autonomous body on 30 January 1992 and was accorded statutory powers with the passing of the SEBI Act, 1992 by the Parliament of India.","It protects the interest of investors in securities and promote and regulate the securities market and for matters connected therewith or incidental thereto."],"statementInstructions":"Which of the statements given above is / are incorrect?","options":["1 only","2 only","3 only","None"],"type":"MCQ"},{"questionNumber":2,"questionText":"Which of the following pairs is/are matched incorrectly?","statements":["Corporatocracy : It is an economic, political and judicial system controlled or influenced by business corporations or corporate interests.","Plutocracy : It is a society that is ruled or controlled by people of great wealth or income.","Kleptocracy : It is a government whose corrupt leaders use political power to expropriate the wealth of the people and land they govern."],"statementInstructions":"Select the answer using the codes given below:","options":["1 only","2 only","3 only","None"],"type":"MCQ"},{"questionNumber":3,"questionText":"\"The main objective of competition law is to promote economic efficiency using competition as one of the means of assisting the creation of market responsive to consumer preferences\". Which of the following is / are an objective of Competition Act of 2002?","statements":[],"statementInstructions":"","options":["Make the markets work for the benefit and welfare of consumers.","Ensure fair and healthy competition in economic activities in the country for faster and inclusive growth and development of the economy.","Implement competition policies with an aim to effectuate the most efficient utilization of economic resources.","All of these"],"type":"MCQ"},{"questionNumber":4,"questionText":"Consider the following statements regarding Reserve Bank of India (RBI):","statements":["RBI was set up based on the recommendations of the Royal Commission on Indian Currency and Finance (1926), also known as the Hilton Young Commission.","RBI was established on April 1, 1935 in accordance with the provisions of the Reserve Bank of India Act, 1934.","RBI was nationalised in 1949 and since then fully owned by the Ministry of Finance under Government of India.","In 2016, the Government of India amended the RBI Act to establish the Monetary Policy Committee."],"statementInstructions":"How many of the above statements is/are correct?","options":["Only one","Only two","Only three","All four"],"type":"MCQ"},{"questionNumber":5,"questionText":"North Atlantic Treaty Organization (NATO) has been a very important military alliance since its formation in 1949. In light of recent geopolitical tensions, particularly following Russia's invasion of Ukraine, discussions around defence spending among member states have intensified. Who among the following is the newest member of NATO?","statements":[],"statementInstructions":"","options":["Sweden","Belgium","Turkey","United Kingdom"],"type":"MCQ"},{"questionNumber":6,"questionText":"Consider the following statements:","statements":["North Eastern Council (NEC) is a statutory advisory body constituted under the North Eastern Council Act 1971 and came into being on 8 August 1972.","The eight States of Northeast India are members of the council, with their respective Chief Ministers and Governors representing them.","The headquarters of the council is situated in Shillong and functions under the Ministry of Development of North Eastern Region (DONER) of the Government of India."],"statementInstructions":"Select the correct answer using the codes given below:","options":["1 & 2 only","1 & 3 only","1 only","1, 2 & 3"],"type":"MCQ"},{"questionNumber":7,"questionText":"With reference to Banking Ombudsmen consider the following statements:","statements":["It is a quasi-judicial authority formed with the aim to address and resolve complaints of the Bank's customers.","Section 35A of the Banking Regulation Act, 1949 deals with Banking Ombudsman Scheme that came into effect in 1995 and presently the Banking Ombudsman Scheme 2006 is in operation."],"statementInstructions":"Select the correct answer using the codes given below:","options":["1 only","2 only","Both 1 & 2","Neither 1 nor 2"],"type":"MCQ"},{"questionNumber":8,"questionText":"Consider the following statements about India:","statements":["India is the seventh-largest country in the world.","It has a land frontier of 15,200 km and a coastline of 7,516 km.","India's territorial waters extend into the sea to a distance of 12 nautical miles from the coast baseline.","The Ganges is the longest river originating in India after Brahmaputra."],"statementInstructions":"Select the correct answer using the codes given below:","options":["1, 2 & 3 only","1 & 4 only","1, 3 & 4 only","1, 2, 3 & 4"],"type":"MCQ"},{"questionNumber":9,"questionText":"Consider the following statements:","statements":["Cyril Radcliffe was the chairman of the Border Commission for India and Pakistan, announced by Lord Mountbatten in 1947.","Radcliffe Line published on 17th August 1947, was the boundary demarcation line between the India and Pakistan's portion of the Punjab and Bengal provinces of British India."],"statementInstructions":"Select the correct answer using the codes given below:","options":["1 only","2 only","Both 1 & 2","Neither 1 nor 2"],"type":"MCQ"},{"questionNumber":10,"questionText":"With reference to Census of India consider the following statements:","statements":["The first official population census of India was conducted in 1872.","Since 1949, it has been conducted by the Registrar General and Census Commissioner of India under the Ministry of Home Affairs.","The slogan of Census 2011 is \"Our Census, Our Future\"."],"statementInstructions":"Select the correct answer using the codes given below:","options":["1 & 3 only","2 & 3 only","3 only","1, 2 & 3"],"type":"MCQ"}]