[{"questionNumber":31,"questionText":"Which one of the following is not basic elements of the citizen charter?","statements":[],"statementInstructions":"","options":["Description of services being provided by department or the agency.","Promotion of various methods to get benefit from the services available.","To expect any public record.","Provision for the inspection of the agency's work."],"type":"MCQ"},{"questionNumber":32,"questionText":"The Union Council of Ministers is the principal executive organ of the Government of India, which serves to aid and advice the President of India in execution of their functions. It is chaired by the Prime Minister of India and consists of the heads of each of the executive government ministries. Currently, who is the Finance Minister of India?","statements":[],"statementInstructions":"","options":["Amit Shah","Rajnath Singh","Nirmala Sitaraman","Nitin Gadkari"],"type":"MCQ"},{"questionNumber":33,"questionText":"Consider the following pairs:","statements":["Jainism : Mahavira","Buddhism : Gautam Buddha","Ajivikas : Makhali Gosala"],"statementInstructions":"Select the incorrectly matched pairs using the codes given below:","options":["1 only","2 & 3 only","1 & 3 only","None"],"type":"MCQ"},{"questionNumber":34,"questionText":"On 25 April 1945, 50 nations assembled in San Francisco, California, for a conference and initialized the drafting of the UN Charter, which was adopted on 25 June 1945. The charter took effect on 24 October 1945, when the United Nation (UN) began operations. The UN is the successor of which organisation?","statements":[],"statementInstructions":"","options":["League against Imperialism","League of Nation","International Court of Justice","Court of Arbitration"],"type":"MCQ"},{"questionNumber":35,"questionText":"__________________, a prince of the Mao-Shan subtribe left Mong Mao in 1215. He was accompanied by three queens, two sons and a daughter; chiefs from five other dependent Mongs; members of the priestly class and soldiers—a total contingent of 9,000. He was the founder of the Ahom kingdom and the architect of Assam. The kingdom he established in 1228 existed for nearly six hundred years and in the process unified the various ethnic groups of the region that left a deep impact on the region?","statements":[],"statementInstructions":"","options":["Chaolung Sukaphaa","Suhungmung","Susenghphaa","Sukhrungphaa"],"type":"MCQ"},{"questionNumber":36,"questionText":"'Singarigharutha' was the traditional coronation ceremony of which kingdom of medieval Assam?","statements":[],"statementInstructions":"","options":["Kachari Kingdom","Ahom Kingdom","Chutia Kingdom","None"],"type":"MCQ"},{"questionNumber":37,"questionText":"Consider the following statements about Zero FIR:","statements":["Zero FIR was introduced after the recommendation of the Justice Verma Committee, which was set up after the 2012 Nirbhaya gangrape case.","It is an FIR that is registered irrespective of the area where the offence is committed and the police can no longer claim that they have no jurisdiction over the case."],"statementInstructions":"Which of the above statement is/are incorrect?","options":["1 only","2 only","Both 1 & 2","Neither 1 nor 2"],"type":"MCQ"},{"questionNumber":38,"questionText":"Allelopathy is need to describe which of the following?","statements":[],"statementInstructions":"","options":["The generation of toxins by one species which inhibits the development of another.","The pathogen's sporulation is inhibited by the host.","Changing the reproductive cycle of one organism by changing the reproductive cycle of another.","By suppressing the reproduction, one species might stifle the expansion of another."],"type":"MCQ"},{"questionNumber":39,"questionText":"If a tropical rain forest is removed, it does not regenerate quickly as compared to a tropical deciduous forest. This is because","statements":[],"statementInstructions":"","options":["exotic species invade the fertile soil of rain forest.","the rain forest species are slow-growing.","propagules of the trees in a rain forest have poor viability.","the soil of rain forest is deficient in nutrients."],"type":"MCQ"},{"questionNumber":40,"questionText":"Consider the following statements:","statements":["Sikkim shares international boundaries with Bhutan, China, and Nepal.","Arunachal Pradesh, Nagaland, Manipur, and Mizoram share an international boundary with Myanmar."],"statementInstructions":"Select the correct answer using the codes given below:","options":["1 only","2 only","Both 1 & 2","Neither 1 nor 2"],"type":"MCQ"}]