[{"questionNumber":51,"questionText":"Which are the elements of sustainable agriculture?","statements":[],"statementInstructions":"","options":["Permaculture","Agroforestry","Mixed Farming","All of these"],"type":"MCQ"},{"questionNumber":52,"questionText":"Consider the following pairs:","statements":["Lachit Divas : 24 November","Rhinoceros Day : 27 September","Krishak Divas : 23 December","Chatra Divas : 31 March"],"statementInstructions":"Which of the pairs given above is not correct?","options":["1 and 3","2 only","4 only","2 and 3"],"type":"STATEMENT_TYPE"},{"questionNumber":53,"questionText":"Who among the following eminent Assamese attended the First Round Table Conference held in London in 1930?","statements":[],"statementInstructions":"","options":["Chandradhar Barua","Hemchandra Goswami","Lakshminath Bezbaruah","Padmanath Gohain Baruah"],"type":"MCQ"},{"questionNumber":54,"questionText":"Why is the Prime Minister in India not directly elected by the people? Choose the most appropriate answer and give reasons for your choice:","statements":[],"statementInstructions":"","options":["In a Parliamentary democracy only the leader of the majority party in the Lok Sabha can become the Prime Minister.","Lok Sabha can remove the Prime Minister and the Council of Ministers even before the expiry of their term.","Since the Prime Minister is appointed by the President there is no need for it.","Direct election of the Prime Minister will involve lot of expenditure on election."],"type":"MCQ"},{"questionNumber":55,"questionText":"Which of the following is the correct statement regarding 'carbon footprint' in the context of global warming?","statements":[],"statementInstructions":"","options":["It is a measure of greenhouse gas emissions by vehicles or any industrial product.","It is a unit under the Kyoto Protocol for reduction in emission of greenhouse gases.","It is an administrative measure to control pollution by providing incentive.","All of the above."],"type":"MCQ"},{"questionNumber":56,"questionText":"'Thang ta', a martial art form is associated with which state of India?","statements":[],"statementInstructions":"","options":["Mizoram","Nagaland","Manipur","Tripura"],"type":"MCQ"},{"questionNumber":57,"questionText":"In spite of being a non-member, who among the following can participate in the proceedings of either House of Parliament, without having the right to vote?","statements":[],"statementInstructions":"","options":["Vice President","Chief Justice of India","Attorney General of India","Comptroller and Auditor General of India"],"type":"MCQ"},{"questionNumber":58,"questionText":"Any such transaction, in which property is transferred in the name of one person and payment is made by another person, is called __________?","statements":[],"statementInstructions":"","options":["Hawala","Benami transaction","Money laundering","Black money"],"type":"MCQ"},{"questionNumber":59,"questionText":"The \"Chipko Movement\" in India is known for:","statements":[],"statementInstructions":"","options":["Advocating for the rights of forest-dwelling tribal communities","Promoting the commercialization of forest resources","Encouraging the construction of large-scale dams in forested areas","Opposing deforestation and environmental degradation"],"type":"MCQ"},{"questionNumber":60,"questionText":"Consider the following statements:","statements":["BRICS is an acronym representing Brazil, Russia, India, China, and South Africa. The group was informally established in 2006 and formalised in 2009.","The inaugural summit of BRICS took place in Yekaterinburg, Russia.","BRICS has since included additional members, including Iran, Egypt, Ethiopia and UAE, reflecting its growing prominence in global affairs.","Recently, Indonesia has officially become a full member of the BRICS group."],"statementInstructions":"How many of the statements given above is/are correct?","options":["Only one","Only two","Only three","All four"],"type":"STATEMENT_TYPE"}]