[{"questionNumber":71,"questionText":"If a tropical rain forest is removed, it does not regenerate quickly as compared to a tropical deciduous forest. This is because","statements":[],"statementInstructions":"","options":["exotic species invade the fertile soil of rain forest.","the rain forest species are slow-growing.","propagules of the trees in a rain forest have poor viability.","the soil of rain forest is deficient in nutrients."],"type":"MCQ"},{"questionNumber":72,"questionText":"Biogas mainly comprises hydro-carbon which is combustible and can produce heat and energy when burnt. It's main component is?","statements":[],"statementInstructions":"","options":["Methane","Oxygen","Nitrogen","Carbon"],"type":"MCQ"},{"questionNumber":73,"questionText":"Allelopathy is need to describe which of the following?","statements":[],"statementInstructions":"","options":["The generation of toxins by one species which inhibits the development of another","The pathogen's sporulation is inhibited by the host","Changing the reproductive cycle of one organism by changing the reproductive cycle of another","By suppressing the reproduction, one species might stifle the expansion of another"],"type":"MCQ"},{"questionNumber":74,"questionText":"With reference to Central Bureau of Investigation (CBI) consider the following:","statements":["It was recommended by the Santhanam Committee on the prevention of corruption","It was established in 1963 by a resolution made by the Ministry of Home Affairs.","It attributes its powers to the Delhi Special Police Establishment Act of 1946.","It provides assistance to the Central Vigilance Commission and Lokpal."],"statementInstructions":"How many of the above statements is/are correct?","options":["Only one","Only two","Only three","All four"],"type":"STATEMENT_TYPE"},{"questionNumber":75,"questionText":"The nomenclature of rural local governments as 'Panchayati Raj' was the result of the suggestion of which Indian leader?","statements":[],"statementInstructions":"","options":["Jawaharlal Nehru","Dr. Rajendra Prasad","Sardar Patel","M. K. Gandhi"],"type":"MCQ"},{"questionNumber":76,"questionText":"Which gas is responsible for depletion of ozone layer?","statements":[],"statementInstructions":"","options":["Carbon dioxide","Carbon monoxide","Nitrous oxide","Chlorofluorocarbons"],"type":"MCQ"},{"questionNumber":77,"questionText":"Consider the following statements:","statements":["On 8 April 1929, Bhagat Singh and Batukeshwar Dutt threw two bombs into the Assembly chamber from its public gallery while it was in session.","Bhagat Singh, Rajguru and Sukhdev were sentenced to death in the Lahore conspiracy case and were hanged on 23 March 1931."],"statementInstructions":"Which of the statements given above is / are incorrect?","options":["1 only","2 only","Both 1 & 2","Neither 1 nor 2"],"type":"STATEMENT_TYPE"},{"questionNumber":78,"questionText":"The word \"Green Revolution\" was in 1968 coined by?","statements":[],"statementInstructions":"","options":["William S. Gaud","Norman Borlaug","Indira Gandhi","MS Swaminathan"],"type":"MCQ"},{"questionNumber":79,"questionText":"Consider the following statements about Zero FIR:","statements":["Zero FIR was introduced after the recommendation of the Justice Verma Committee, which was set up after the 2012 Nirbhaya gangrape case.","It is an FIR that is registered irrespective of the area where the offence is committed and the police can no longer claim that they have no jurisdiction over the case."],"statementInstructions":"Which of the above statement is/are incorrect?","options":["1 only","2 only","Both 1 & 2","Neither 1 nor 2"],"type":"STATEMENT_TYPE"},{"questionNumber":80,"questionText":"With reference to River Brahmaputra consider the following statements:","statements":["It originates from Chemayungdung glacier of the Kailash range near the Mansarovar lake.","It takes a U-turn on reaching Namcha Barwa.","In Tibet it is known as the Tsangpo, which means 'the purifier.'"],"statementInstructions":"Which of the statements given above is /are incorrect?","options":["1 only","2 only","3 only","None"],"type":"STATEMENT_TYPE"}]