[{"questionNumber":41,"questionText":"The 'Statue of Unity' is located on the Narmada river-facing ________________ in Kevadiya colony, Narmada District in the Indian State of Gujarat?","statements":[],"statementInstructions":"","options":["Sardar Sarovar Dam","Hirakud Dam","Gandhi Sagar Dam","Tehri Dam"],"type":"MCQ"},{"questionNumber":42,"questionText":"Recently, the Chief Miniter of Assam announced that _____________ will become the state's second capital within three years along with a permanent assembly building?","statements":[],"statementInstructions":"","options":["Jorhat","Dibrugarh","Sibsagar","Tezpur"],"type":"MCQ"},{"questionNumber":43,"questionText":"With reference to Insurance Regulatory and Development Authority of India (IRDAI) consider the following statements:","statements":["The head office of the IRDAI is situated in Hyderabad.","It was constituted by the recommendations of the Malhotra Committee report, in 1999.","It is an autonomous body and was incorporated as a statutory body in April 2000."],"statementInstructions":"Which of the above statements is/are correct?","options":["1 & 2 only","2 & 3 only","1 & 3 only","All of the above"],"type":"MCQ"},{"questionNumber":44,"questionText":"The role of the Finance Commission is to ________?","statements":[],"statementInstructions":"","options":["recommend the formula for sharing revenue between the Centre and the States","grant revenue to the States","allocate funds for different heads of the Centre and the States","collection of different taxes including GST"],"type":"MCQ"},{"questionNumber":45,"questionText":"Which of the following is not a southern tributary of the Brahmaputra?","statements":[],"statementInstructions":"","options":["Dikhow","Borgang","Bhogdoi","Krishnai"],"type":"MCQ"},{"questionNumber":46,"questionText":"'Thang ta', a martial art form is associated with which state of India?","statements":[],"statementInstructions":"","options":["Mizoram","Nagaland","Manipur","Tripura"],"type":"MCQ"},{"questionNumber":47,"questionText":"In spite of being a non-member, who among the following can participate in the proceedings of either House of Parliament, without having the right to vote?","statements":[],"statementInstructions":"","options":["Vice President","Chief Justice of India","Attorney General of India","Comptroller and Auditor General of India"],"type":"MCQ"},{"questionNumber":48,"questionText":"With reference to Central Bureau of Investigation (CBI) consider the following:","statements":["It was recommended by the Santhanam Committee on the prevention of corruption","It was established in 1963 by a resolution made by the Ministry of Home Affairs.","It attributes its powers to the Delhi Special Police Establishment Act of 1946.","It provides assistance to the Central Vigilance Commission and Lokpal."],"statementInstructions":"How many of the above statements is/are correct?","options":["Only one","Only two","Only three","All four"],"type":"MCQ"},{"questionNumber":49,"questionText":"Which is the role of the International Monetary Fund (IMF)?","statements":[],"statementInstructions":"","options":["To implement and advance global trade agreements","To settle industrial and trade disputes between members","To help poorer countries with their economic development","To maintain international financial stability in global financial markets"],"type":"MCQ"},{"questionNumber":50,"questionText":"Which of the following statements appropriately describes the \"fiscal stimulus\"?","statements":[],"statementInstructions":"","options":["It is a massive investment by the Government of the manufacturing sector to ensure the supply of goods to meet the demand surge caused by rapid economic growth.","It is an intense affirmative action of the Government to boost economic activity in the country.","It is the Government's action of financial institutions to ensure the disbursement of loans to agriculture and allied sectors to promote greater food production and contain food inflation.","It is an extreme affirmative action by the Government to pursue its policy of financial inclusion."],"type":"MCQ"}]